m7mdwalid1/AVR_ATMEGA32_Drivers/MCAL/DIO/HEADER/DIO_private.h
/*
 * DIO_private.h
 *
 *  Created on: Aug 21, 2022
 *      Author: mhmd waleed
 */

#ifndef MCAL_DIO_HEADER_DIO_PRIVATE_H_
#define MCAL_DIO_HEADER_DIO_PRIVATE_H_
/************************ GROUP NUMBER ************************/

#define PORT_A  0
#define PORT_B  1
#define PORT_C  2
#define PORT_D  3

/************************ PIN NUMBER ************************/

#define PIN_A0  0
#define PIN_A1  1
#define PIN_A2  2
#define PIN_A3  3
#define PIN_A4  4
#define PIN_A5  5
#define PIN_A6  6
#define PIN_A7  7

#define PIN_B0  0
#define PIN_B1  1
#define PIN_B2  2
#define PIN_B3  3
#define PIN_B4  4
#define PIN_B5  5
#define PIN_B6  6
#define PIN_B7  7

#define PIN_C0  0
#define PIN_C1  1
#define PIN_C2  2
#define PIN_C3  3
#define PIN_C4  4
#define PIN_C5  5
#define PIN_C6  6
#define PIN_C7  7

#define PIN_D0  0
#define PIN_D1  1
#define PIN_D2  2
#define PIN_D3  3
#define PIN_D4  4
#define PIN_D5  5
#define PIN_D6  6
#define PIN_D7  7

#define PIN_INPUT     0
#define PIN_OUTPUT    1

#define DIO_LOW       0
#define DIO_HIGH      1

#define PORT_INPUT     0x00
#define PORT_OUTPUT    0xFF


#define PORT_LOW       0x00
#define PORT_HIGH      0xff


#define DIO_EN_PULL_UP_RES     1
#define DIO_DIS_PULL_UP_RES    0


#endif /* MCAL_DIO_HEADER_DIO_PRIVATE_H_ */
